b = int(input("Введите первый элемент геометрической прогрессии" )) #первый элемент геометрической прогрессии 
q = int(input("Ввдеитемножитель геометрической прогрессии")) #множитель геометрической прогрессии
n = int(input("Введиете номер последнего элемента геометрической прогрессии")) #номер последнего элемента геометрической прогрессии
i = 0 #счетчик цикла
S = 0  #задаем сумму геометрической прогрессии 
while i < n:#цикл , считающий сумму геометрической прогрессии
    S += b# каждый элемент заносим прибавляем к искомой сумму
    b *= q#считаем каждый следущий элемент через шаг геометрической прогрессии
    i +=1# считаем шаги цикла
print(f"Cумма геометрической прогрессии: {S}") #вывод суммы геометрической прогрессии 