n = int(input("Введите число ")) #Ввод проверяемого числа
if n == 2: #частный случай двойки 
    print('Число простое')
else:
    if n % 2 != 0: #проверка на простоту числа
        for divider in range(2, int(n**0.5)+1): #берем все числа до квадратного корня самого числа
            if n % divider == 0: # если делится на эти числа без остатка число непростое
                print('Число непростое')
                break
            else: 
                print('Число простое') #в противном случае число простое
                break
    else:
        print('Число непростое')

            
               
        